Can't delete infilling element without deleting its insert or host.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotDeleteInfill { get; }
  Visual Basic
Public Shared ReadOnly Property CannotDeleteInfill As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotDeleteInfill {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures InfillFailures Class
  Autodesk.Revit.DB Namespace